/* Прогресс-бар на ЖК-дисплее */

#include<LiquidCrystal.h>
LiquidCrystal lcd(2, 3, 4, 5, 6, 7);  // Инициализация экземпляра библиотеки LiquidCrystal

  // Массивы для символов прогресс-бара
byte p20[8] = {
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
  B10000,
};
byte p40[8] = {
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
  B11000,
};
byte p60[8] = {
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
  B11100,
};
byte p80[8] = {
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
  B11110,
};
byte p100[8] = {
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
  B11111,
};

void setup() {                    
 lcd.begin(16, 2);                  // Настройка экземпляра дисплея - число столбцов и строк
 lcd.print("It's my display");

    // Определение пользовательских символов
 lcd.createChar(0, p20);
 lcd.createChar(1, p40);
 lcd.createChar(2, p60);
 lcd.createChar(3, p80);
 lcd.createChar(4, p100);
}

void loop() {
  lcd.setCursor(0, 1);               // Установить курсор в начало второй строки
  lcd.print("                ");     // Очистка второй строки (16 пробелов)
  for(int i = 0; i < 16; i++) {      // Перебор каждого символа на второй строке
    for (int j = 0; j < 5; j++) {    // Перебор каждого значения (p20 - p100)
      lcd.setCursor(i, 1);           // Столбец установки курсора
      lcd.write(j);                  // Вывод символа
      delay(100);
    }
  }
}
